---
type: MasonryCMU
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 9
tags: [revit-api, class]
---

# MasonryCMU

`Autodesk.Revit.DB.Visual.MasonryCMU` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | CommonTintColor | 2018.1 | `public static string CommonTintColor { get ; }` |
| Property | CommonTintToggle | 2018.1 | `public static string CommonTintToggle { get ; }` |
| Property | MasonryCMUApplication | 2018.1 | `public static string MasonryCMUApplication { get ; }` |
| Property | MasonryCMUColor | 2018.1 | `public static string MasonryCMUColor { get ; }` |
| Property | MasonryCMUColorByObject | 2018.1 | `public static string MasonryCMUColorByObject { get ; }` |
| Property | MasonryCMUPattern | 2018.1 | `public static string MasonryCMUPattern { get ; }` |
| Property | MasonryCMUPatternHeight | 2018.1 | `public static string MasonryCMUPatternHeight { get ; }` |
| Property | MasonryCMUPatternMap | 2018.1 | `public static string MasonryCMUPatternMap { get ; }` |
| Property | MasonryCMUType | 2018.1 | `public static string MasonryCMUType { get ; }` |